scripts/UC_2_buyItem/result1/Iteration5/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>234Michael</ns2:safePayUsername><ns2:safePayPassword>8c5d1d528d4a23419afe9e4e1353231952052ec6</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886890123456789</ns2:cardNumber><ns2:expirationDate>082025</ns2:expirationDate><ns2:cvvNumber>756</ns2:cvvNumber><ns2:customerName>Michael Brown</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>